/*----------------------------------------------------------
// 初期化する関数
----------------------------------------------------------*/
/**
* 技テーブルクリック時の関数
* @function click
* @return void
**/
var navMoveBoxInit = function(){
    $('.move-detail-link').click(function(){
        var target = $(this).data('target');
        $('.move-detail-content').each(function(){
            $(this).removeClass('active');
        });
        $(target).addClass('active');
    });
}


/*----------------------------------------------------------
// 処理内で呼び出す関数
----------------------------------------------------------*/


/*----------------------------------------------------------
// 初期化
----------------------------------------------------------*/
jQuery(function($){
    navMoveBoxInit();
});
