
/*----------------------------------------------------------
// 初期化する関数
----------------------------------------------------------*/
/**
* フィールド選択
* @function submit
* @return void
**/
var selectFieldInit = function(){
    $('form#select-field-form [name="field"]').on('change', function(){
        var field = $(this).val();
        $('#select-filed-image').attr('src', '/Assets/img/fields/' + field + '.png')
        .show();
    });
}

/*----------------------------------------------------------
// 処理内で呼び出す関数
----------------------------------------------------------*/


/*----------------------------------------------------------
// 初期化
----------------------------------------------------------*/
jQuery(function($){
    selectFieldInit();
});
