/*----------------------------------------------------------
// 初期化する関数
----------------------------------------------------------*/

/**
* 技テーブルクリック時の関数
* @function click
* @return void
**/
var clickMoveInit = function(){
    $('.move-table-row > [data-move!="details"]').on('click', function(){
        var key = $(this).parent().data('key');
        // 技をフォームへセット
        $('#fight-form-param').val(key);
        // サブミット実行
        $('#fight-form').submit();
    });
}

/*----------------------------------------------------------
// 処理内で呼び出す関数
----------------------------------------------------------*/

/*----------------------------------------------------------
// 初期化
----------------------------------------------------------*/
jQuery(function($){
    clickMoveInit();
});
