<?php # 最初のポケモン選びについて ?>
<div id="help-accordion-<?=$num?>-head" class="card-header" data-toggle="collapse" data-target="#help-accordion-<?=$num?>-content" aria-expanded="true" aria-controls="help-accordion-<?=$num?>-content" style="cursor: pointer;">
    最初のポケモン選びについて
</div>
<div id="help-accordion-<?=$num?>-content" class="collapse" aria-labelledby="help-accordion-<?=$num?>-head" data-parent="#help-accordion">
    <div class="card-body">
        <h5 class="card-title text-danger">よく考えて選びましょう</h5>
        <p class="card-text">
            最初のポケモンとして４匹の中から選ぶことができますが、慎重に選ぶことをオススメします。
        </p>
        <hr>
        <h6>フシギダネ</h6>
        <p class="card-text">
            他の3匹には無い「回復技」を序盤で覚えるため、覚えてしまえばバトルによる戦闘不能の確率を大幅に減らすことができます。そのため、早い段階から進化することができ、更にバトルでは有利な立場を取り続けることができます。<br>
            しかし、覚える攻撃技は最初のたいあたりを除いて、くさタイプの技しか覚えません。そのため、相性不利の相手と当たると徹底的に苦戦を強いられることになります。
        </p>
        <hr>
        <h6>ヒトカゲ</h6>
        <p class="card-text">
            初期の補助技にも恵まれておらず、序盤はそこそこの苦戦を強いられますが、習得する技には状態異常の追加効果があるなど、技を覚えていくことによって力を発揮します。また、ほのおタイプの技以外にも追加効果があるものが多く、進化・技習得をすることで更に力を発揮してくれます。<br>
            アニメポケモンでもおなじみ、中盤から後半にかけて活躍をするエース的な存在です。
        </p>
        <hr>
        <h6>ゼニガメ</h6>
        <p class="card-text">
            最初の4匹の中で唯一弱点タイプを2匹抱えているため、序盤から中盤まで苦戦を強いられるポケモンです。技の習得もヒトカゲと比べるといまいちで、フシギダネのように補助技にも恵まれておらず、最終進化へ行き着くまでは常にジリ貧の戦いを強いられるでしょう。しかし、フシギダネ・ヒトカゲと違って初期の補助技で、相手の防御力を下げる「しっぽをふる」を覚えているのは評価できるポイントです。<br>
            ですが、終盤はチャージ不要の高火力技を習得するため、終盤では活躍を見せてくれるため、じっくりと育てることでその良さを発揮できるポケモンです。
        </p>
        <hr>
        <h6>ピカチュウ</h6>
        <p class="card-text">
            他のポケモンと違い、初期技でタイプ一致技を覚えている優秀なポケモンです。更に序盤で優秀な補助技を覚え、高い素早さを兼ね備えていることもあり、他の3匹と比べると序盤での活躍度は格段に期待できます。また、初期技のでんきショックが「特殊技」ということもあり、フシギダネやヒトカゲが覚えている「なきごえ」の影響を受けることがありません。<br>
            しかし、他の3匹に比べて進化という点では恵まれておらず、現段階では進化する術をもっていません。もし進化できたとしても、進化後はまともな技を覚えてくれないため、技を十分に習得するまでは低種族値のまま戦い続けなければならず、中盤から後半の失速が顕著です。
        </p>
    </div>
</div>
