<?php
return [
    // 更新情報
    'update' => [
        'title' => 'システム情報',
        'info' => [
			['2021/05/05', 'アップデートを実施しました'],
            ['2020/12/05', 'メモリ使用量軽量化のアップデートを実施しました'],
            ['2020/12/04', '廃人歓喜！努力値達成率が見れるようになりました'],
            ['2020/12/04', '経験値の分配値の不備を修正しました'],
            ['2020/12/01', '技「でんこうせっか」の威力不備を修正しました'],
            ['2020/12/01', '経験値分配システムを実装しました'],
            ['2020/11/30', 'スマートフォンでポケモンの並び替えが出来ない不具合を解消しました'],
            ['2020/11/30', 'ポケモン図鑑を導入しました'],
            ['2020/11/30', '大型アップデートを実施しました'],
            ['2020/11/29', 'パーティーシステムを導入しました'],
            ['2020/11/28', '馴染み深いデザインに変更しました'],
            ['2020/11/14', 'プレイヤーシステムを導入しました'],
            ['2020/10/29', '進化演出を導入しました'],
            ['2020/10/19', 'ヘルプページを増設しました'],
            ['2020/10/17', '技習得時のバグを修正しました'],
            ['2020/10/16', '経験値取得時のアニメーションを追加しました'],
            ['2020/10/12', 'PHPポケモン（α）を公開しました'],
        ],
    ],
    // ポケモンセンターより
    'center' => [
        'title' => 'ポケモンセンター',
        'info' => [
            ['2020/11/28', 'ポケモン預かりシステムを設置しました'],
            ['2020/10/12', 'ポケモンセンターをオープンしました'],
        ],
    ],
    // フレンドリィショップより
    'shop' => [
        'title' => 'フレンドリィショップ',
        'info' => [
			['2021/05/05', '進化の石の販売を開始しました'],
			['2021/05/05', 'わざマシンを入荷しました'],
            ['2020/11/30', '初期ユーザーにキズぐすりとモンスターボールを配布中です'],
            ['2020/11/28', 'モンスターボールを入荷しました'],
            ['2020/11/15', 'フレンドリィショップをオープンしました'],
        ],
    ],
    // フィールド情報
    'field' => [
        'title' => 'フィールド情報',
        'info' => [
			['2021/05/05', 'ジムがオープンしました'],
            ['2020/12/01', 'コイキングの目撃情報がありました・・・？'],
            ['2020/12/01', '2番道路へ行けるようになりました'],
            ['2020/11/30', '出現ポケモンは捕捉率と関係があるようです'],
            ['2020/11/29', '1番道路でポッポの目撃情報がありました'],
            ['2020/11/29', 'フィールド選択ができるようになりました'],
        ],
    ],
];
